# 001 테이블에서 특정 열(COLUMN) 선택하기

```python
# SQL 구문
select ename, sal
        from emp;
```    
---
<해석>
select = 조회 / 선택해라

ename, sal 등등 = 'COLUMN' 이라고 함

from = ~로 부터

emp = emp table

; = 앞의 명령어를 '실행해라'

In [1]:
%load_ext sql

# postgresql://Username:Password@Host:Port/Database
%sql postgresql://myuser:myuser@206.189.155.123:5433/dvdrental

'Connected: myuser@dvdrental'

## 문제 1. 이름과 월급과 직업을 출력하시오

In [2]:
%%sql
select ename, job, sal
    from emp;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
14 rows affected.

[('KING', 'PRESIDENT', Decimal('5000.00')),
 ('BLAKE', 'MANAGER', Decimal('2850.00')),
 ('CLARK', 'MANAGER', Decimal('2450.00')),
 ('JONES', 'MANAGER', Decimal('2975.00')),
 ('MARTIN', 'SALESMAN', Decimal('1250.00')),
 ('ALLEN', 'SALESMAN', Decimal('1600.00')),
 ('TURNER', 'SALESMAN', Decimal('1500.00')),
 ('JAMES', 'CLERK', Decimal('950.00')),
 ('WARD', 'SALESMAN', Decimal('1250.00')),
 ('FORD', 'ANALYST', Decimal('3000.00')),
 ('SMITH', 'CLERK', Decimal('800.00')),
 ('SCOTT', 'ANALYST', Decimal('3000.00')),
 ('ADAMS', 'CLERK', Decimal('1100.00')),
 ('MILLER', 'CLERK', Decimal('1300.00'))]

## 문제 2. 이름과 입사일과 부서번호를 출력하시오.

In [3]:
%%sql
select ename, hiredate, deptno
    from emp;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
14 rows affected.

[('KING', datetime.date(1981, 11, 17), Decimal('10')),
 ('BLAKE', datetime.date(1981, 5, 1), Decimal('30')),
 ('CLARK', datetime.date(1981, 5, 9), Decimal('10')),
 ('JONES', datetime.date(1981, 4, 1), Decimal('20')),
 ('MARTIN', datetime.date(1981, 9, 10), Decimal('30')),
 ('ALLEN', datetime.date(1981, 2, 11), Decimal('30')),
 ('TURNER', datetime.date(1981, 8, 21), Decimal('30')),
 ('JAMES', datetime.date(1981, 12, 11), Decimal('30')),
 ('WARD', datetime.date(1981, 2, 23), Decimal('30')),
 ('FORD', datetime.date(1981, 12, 11), Decimal('20')),
 ('SMITH', datetime.date(1980, 12, 9), Decimal('20')),
 ('SCOTT', datetime.date(1982, 12, 22), Decimal('20')),
 ('ADAMS', datetime.date(1983, 1, 15), Decimal('20')),
 ('MILLER', datetime.date(1982, 1, 11), Decimal('10'))]

## 문제 3. emp 테이블에 어떤 컬럼들이 있는지 확인하시오

* 오라클 기반의 SQL에서는 아래와 같이 입력하여 테이블 컬럼들을 확인할 수 있다.
```sql
desc emp
describe emp
```
---
* postgresql 에서는 '\d'를 사용해 테이블 컬럼들을 확인할 수 있다.
```sql
\d emp
```

## 문제 4. 이름 , 월급, 커미션을 출력하시오

In [4]:
%%sql

select ename, sal, comm
    from emp;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
14 rows affected.

[('KING', Decimal('5000.00'), None),
 ('BLAKE', Decimal('2850.00'), None),
 ('CLARK', Decimal('2450.00'), None),
 ('JONES', Decimal('2975.00'), None),
 ('MARTIN', Decimal('1250.00'), Decimal('1400.00')),
 ('ALLEN', Decimal('1600.00'), Decimal('300.00')),
 ('TURNER', Decimal('1500.00'), Decimal('0.00')),
 ('JAMES', Decimal('950.00'), None),
 ('WARD', Decimal('1250.00'), Decimal('500.00')),
 ('FORD', Decimal('3000.00'), None),
 ('SMITH', Decimal('800.00'), None),
 ('SCOTT', Decimal('3000.00'), None),
 ('ADAMS', Decimal('1100.00'), None),
 ('MILLER', Decimal('1300.00'), None)]

**- Tip. SQL 입력시 주의 사항**

- SQL 은 대/소문자를 가리지 않는다.

* 소문자 : select ename, sal from emp;

* 대문자 : SELECT ENAME, SAL FROM EMP;

어떻게 입력해도 결과는 같다.

---
**- SQL 에서 '절'은 다음 라인으로 '분리'해서 작성한다.**

<절의 종류>

SELECT 절

FROM 절

그 외에도

where

group by

having

등등 이 있다.

---

**- Tip. 실제 작업을 하다보면 내용이 길어지기때문에 옆으로 늘리지 말고 아래로 내리자!**

- 들여쓰기('tap 버튼')를 사용해서 SQL의 '가독성'을 높이는 것이 중요!

SQL 코딩한 것에서 에러를 찾기에는 '소문자'가 더 좋다! -> 그러니 가급적 소문자로 입력할 것!


지금은 몇줄 되지 않기 때문에 크게 티가 나지 않지만, 실무에서 여러줄의 코드를 쓰다보면 확연히 차이가 발생한다.

case 1) 한줄로 작성하는 경우

In [5]:
%%sql

select ename, job, hiredate, deptno from emp where sal between 1000 and 3000 order by ename;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
11 rows affected.

[('ADAMS', 'CLERK', datetime.date(1983, 1, 15), Decimal('20')),
 ('ALLEN', 'SALESMAN', datetime.date(1981, 2, 11), Decimal('30')),
 ('BLAKE', 'MANAGER', datetime.date(1981, 5, 1), Decimal('30')),
 ('CLARK', 'MANAGER', datetime.date(1981, 5, 9), Decimal('10')),
 ('FORD', 'ANALYST', datetime.date(1981, 12, 11), Decimal('20')),
 ('JONES', 'MANAGER', datetime.date(1981, 4, 1), Decimal('20')),
 ('MARTIN', 'SALESMAN', datetime.date(1981, 9, 10), Decimal('30')),
 ('MILLER', 'CLERK', datetime.date(1982, 1, 11), Decimal('10')),
 ('SCOTT', 'ANALYST', datetime.date(1982, 12, 22), Decimal('20')),
 ('TURNER', 'SALESMAN', datetime.date(1981, 8, 21), Decimal('30')),
 ('WARD', 'SALESMAN', datetime.date(1981, 2, 23), Decimal('30'))]

case 2) 아래로 내려 쓰면서 작성하는 경우

In [6]:

%%sql

select ename, job, hiredate, deptno 
    from emp 
    where sal between 1000 and 3000 
    order by ename;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
11 rows affected.

[('ADAMS', 'CLERK', datetime.date(1983, 1, 15), Decimal('20')),
 ('ALLEN', 'SALESMAN', datetime.date(1981, 2, 11), Decimal('30')),
 ('BLAKE', 'MANAGER', datetime.date(1981, 5, 1), Decimal('30')),
 ('CLARK', 'MANAGER', datetime.date(1981, 5, 9), Decimal('10')),
 ('FORD', 'ANALYST', datetime.date(1981, 12, 11), Decimal('20')),
 ('JONES', 'MANAGER', datetime.date(1981, 4, 1), Decimal('20')),
 ('MARTIN', 'SALESMAN', datetime.date(1981, 9, 10), Decimal('30')),
 ('MILLER', 'CLERK', datetime.date(1982, 1, 11), Decimal('10')),
 ('SCOTT', 'ANALYST', datetime.date(1982, 12, 22), Decimal('20')),
 ('TURNER', 'SALESMAN', datetime.date(1981, 8, 21), Decimal('30')),
 ('WARD', 'SALESMAN', datetime.date(1981, 2, 23), Decimal('30'))]

## 문제 5. 이름, 직업, 입사일, 부서번호를 출력하시오. (비교)

In [7]:
%%sql

select ename, job, hiredate, deptno
    from emp;

 * postgresql://myuser:***@206.189.155.123:5433/dvdrental
14 rows affected.

[('KING', 'PRESIDENT', datetime.date(1981, 11, 17), Decimal('10')),
 ('BLAKE', 'MANAGER', datetime.date(1981, 5, 1), Decimal('30')),
 ('CLARK', 'MANAGER', datetime.date(1981, 5, 9), Decimal('10')),
 ('JONES', 'MANAGER', datetime.date(1981, 4, 1), Decimal('20')),
 ('MARTIN', 'SALESMAN', datetime.date(1981, 9, 10), Decimal('30')),
 ('ALLEN', 'SALESMAN', datetime.date(1981, 2, 11), Decimal('30')),
 ('TURNER', 'SALESMAN', datetime.date(1981, 8, 21), Decimal('30')),
 ('JAMES', 'CLERK', datetime.date(1981, 12, 11), Decimal('30')),
 ('WARD', 'SALESMAN', datetime.date(1981, 2, 23), Decimal('30')),
 ('FORD', 'ANALYST', datetime.date(1981, 12, 11), Decimal('20')),
 ('SMITH', 'CLERK', datetime.date(1980, 12, 9), Decimal('20')),
 ('SCOTT', 'ANALYST', datetime.date(1982, 12, 22), Decimal('20')),
 ('ADAMS', 'CLERK', datetime.date(1983, 1, 15), Decimal('20')),
 ('MILLER', 'CLERK', datetime.date(1982, 1, 11), Decimal('10'))]